#+OPTIONS: toc:nil

#+BEGIN_VERSE
This page is a work in progress.
#+END_VERSE

Linkspace shares an idea with git, bitcoin, bittorrent, and many other platforms/backends : hash addressable content.  
It is the only way to properly design multi-party systems and it is extremely useful.  

Instead of wasting time (re)inventing: "How do I organize sockets streaming data and what are my domain specific semantics for referencing (semi-permanent) data".
Linkspace makes the right choices and lets you build (user) applications by defining a function over a shared state. i.e. "What data is available locally, how do I use it, what more do I want".

Linkspace is meant to be general purpose, fast, and can be used as a library or in a script.

This is a ~10 min primer on the linkspace cli `lk` using bash.
For a guide using python check out the guide or tutorials.
Clone and build the latest version to follow along.
# You can try it out yourself by downloading the latest release [[https://github.com/AntonSol919/linkspace/releases][here]].

#+BEGIN_SRC bash :session codeorg :exports none
  cd /tmp/
  rm -r linkspace
#+END_SRC

#+BEGIN_SRC bash :session codeorg :exports both :results output verbatim
  lk --version
#+END_SRC

*** A general purpose supernet

You build an application by picking a domain name (like you would an ip 'port').
For example `imageboard`.

#+BEGIN_VERSE
`pktf` is common enough to have the alias `lk p`.
#+END_VERSE

#+BEGIN_SRC bash :session codeorg :exports both :results output verbatim
  curl -s "https://upload.wikimedia.org/wikipedia/commons/3/35/Tux.svg" | lk datapoint > tux.pkt
  TUX_DATA=$(cat tux.pkt | lk p "[hash:str]")
  lk linkpoint imageboard::/hello/tux.svg -- data:$TUX_DATA >> tux.pkt
  TUXPKTS=($(cat tux.pkt | lk p "[hash:str]")) # store as an array
  lk save --pkts ./tux.pkt # `cat` is usually useless but can be easier to read.
#+END_SRC

The goal of linkspace is to have the application you build operating in a network with multiple devices.

A typical linkspace applications doesn't have to deal with sockets.
But when designing you need to consider what to do when not all linked packets are available.

#+BEGIN_VERSE
That is a challenge at first. But the end result are better applications in general.
Applications designed for sockets that read/write streams of data allow us to ignore asynchronicity and partial/corrupted state 99% of the time.

Until we can't ignore that 1%.
#+END_VERSE

To process the links of a packet you could wait for them manually. e.g. 
#+BEGIN_SRC bash :session codeorg :exports both :results output verbatim
  lk watch-hash ${TUXPKTS[1]} | lk p "[links]" | cut -d':' -f2 | xargs -i lk watch-hash "{}" | lk pktf "Linked to [hash:str] which has [data_size:str] bytes"
#+END_SRC

#+RESULTS:
#+begin_example
read pkt Sz0ZZDWxKht-jbM7Tfkn0nis4tNoKNPH_kfI7JYUnY4 with 49983 bytes
#+end_example

But `lk get-links` has a few common strategies that might be simpler.

#+BEGIN_SRC bash :session codeorg :exports both :results output verbatim
  lk watch-hash ${TUXPKTS[1]} | lk get-links pause | lk pktf [hash:str] # reads links in order and waits if not immediatly found.
#+END_SRC

#+BEGIN_VERSE
Note that in the previous example quoting "[links]" was required.
Without it the characters `[lin` are interpreted by a default bash shell.
#+END_VERSE


The final piece of the puzzle is how exchanging points is organized.
Each linkpoint has a group. A group is 32 bytes to signal the intended set of recipients.
Members ensure only members have access to the points.
By convention, the public group is:

#+BEGIN_SRC bash :session codeorg :exports both :results output verbatim
  PUB=$(echo "Hello, Sol!" | lk data | lk pktf "[hash:str]")
  echo $PUB
#+END_SRC

If no group is specified (like we've been doing) the public group is used.

#+BEGIN_SRC bash :session codeorg :exports both :results output verbatim
  lk watch-hash ${TUXPKTS[1]} | lk p [group:str]
#+END_SRC

The other special group is '[0;32]', also called the private group.
You can refer to it with the expression `[#:0]`.
Functions/subcommands that read/write existing points skip/warn whenever a point from the private group is seen unless enabled with `--private`.

#+BEGIN_SRC bash :session codeorg :exports both :results output verbatim
  lk linkpoint example:[#:0] | lk save 2>&1 # creating a packet is ok - but receving not accepted by `lk save` without --private
#+END_SRC

#+BEGIN_VERSE
See [[./docs/guide/index.html#ABE][ABE]] for more on the `[..]` syntax.
#+END_VERSE

You can build a system to exchange points in a group from scratch.
Linkspace does not prescribe a way to exchange points.
Each group is different that no single solution can cover every situation.

For instance, use `lk watch imageboard:$MYGROUP | ...` and forward the stream to another device using netcat/socat, ssh, email, http, a USB stick, or any other way to exchange data.

A `point` refers to the fields we've seen.
All these fields are included in the hash.
Serialized the point packets include the fields, the hash, and 32 unhashed/mutable bytes.

Filters work on these mutable fields as well.
This let you quickly build specific network topologies.

#+BEGIN_VERSE
See [[./docs/guide/index.org#mutable][the guide]] for the mutable field names.
#+END_VERSE

#+BEGIN_SRC
  netcat 10.0.0.1 -p 6000 | lk route ubits0:=:0000 | lk save & # get packets from a host and set their ubits0 to 0000
  netcat 10.0.0.2 -p 6000 | lk route ubits0:=:0001 | lk save & # get packets from another host and set their ubits0 to 0001
  lk linkpoint example::/hello | lk route ubits0:=:0002 | lk save # save my packets with ubits 0002
  lk watch-log --asc example::/hello -- "ubits0:>:0000" | nc 10.0.0.1 -p 6000  & # forward all packets with ubits0 higher than 0000 back to host. 
#+END_SRC

Linkspace does define some conventions.
These are functions that encoded creating/watching points with some predefined pathname, links, and data format.
Conventions enable interoperability between multiple applications and background processes.

An example is `pull`. This writes a query to a specific location.

#+BEGIN_SRC bash :session codeorg :exports both :results output verbatim
  lk pull imageboard::/hello --write stdout | lk p "[path:str]\n[data]"
#+END_SRC

The goal of `pull` is to allow one process e.g. an application like [[./docs/tutorial/imageboard.html][imageboard (bash)]] or [[./docs/tutorial/mineweeper-1.html][mineweeper (python)]]
to signal another process, e.g. a group exchange application like  [[./docs/tutorial/bash.exchange.html][bash.exchange]],
that it should try and retrieve packets matching a query from the group.

Queries are the standard way to define a 'set of points' in linkspace.
The `filter` and `watch` commands are syntax sugar over queries.
You can see those by using `--print-query`.
Queries are designed such that joining two query strings the result is the common subset of both (or an 'set empty' error).

That's it for this quick introduction.
For more in-depth info read the [[./docs/guide/index.html][Guide]].

